# BalusterPattern Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPattern Class
Members See Also
---
Baluster pattern class.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class BalusterPattern : IDisposable
```

Visual Basic
---
```text
Public Class BalusterPattern _
	Implements IDisposable
```

Visual C++
---
```text
public ref class BalusterPattern : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Architecture..::..BalusterPattern
# See Also
BalusterPattern Members
Autodesk.Revit.DB.Architecture Namespace